04_OpenFoam/_ref/OpenFOAM-14/isothermalFluid/potentialFreeSurfaceMovingOscillatingBox/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0.orig";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [pressure];

internalField   uniform 0;

boundaryField
{
    freeSurface
    {
        type            waveSurfacePressure;
        value           uniform 0;
    }

    ".*Wall"
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    "floatingObject.*"
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
